<template>
    <div>
        <div class="report-height problem-main">
 
            <dl>
                <dt>第一球~第五球：</dt>
                <dd>
                    第一球、第二球、第三球、第四球、第五球：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码
                    08，下注第一球为 08 者视为中奖，其余情形视为不中奖。
                </dd>
            </dl>
            <dl>
                <dt>单双大小</dt>
                <dd>根据相应单项投注第一球 ~ 第五球开出的球号，判断胜负。</dd>
            </dl>
            <dl>
                <dt>大小：</dt>
                <dd>对应位置开奖号码大小，01-05为小，06-10为大，开出11为和局。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖，和局不计算结果。</dd>
            </dl>
            <dl>
                <dt>单双：</dt>
                <dd>对应位置开奖号码是为单数或双数，01、03、05、07、09为单，02、04、06、08、10为双，开出11为和局。
                        若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖，和局不计算结果。
                </dd>
            </dl>

            <dl>
                <dt>总和大小：</dt>
                <dd>当期所有5个开奖号码总和值（15-45）大小，15-29为小，31-45为大，开出30为和局。
                        若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖，和局不计算结果。</dd>
            </dl>

            <dl>
                <dt>总和单双：</dt>
                
                <dd>
                    当期所有5个开奖号码总和值（15-45）是为单数或双数，15、17、19、……41、43、45为单，16、18、20、……40、42、44为双。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。
                </dd>
            </dl>
            <dl>
                <dt>总尾大小：</dt>
                
                <dd>
                    当期所有5个开奖号码总和值个位数（0-9）大小，0-4为小，5-9为大。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。
                </dd>
            </dl>
            <dl>
                <dt>龙虎斗：</dt>
                
                <dd>
                    以第一球（龙）VS.第五球（虎）开奖号码点数大小判断胜负，若第一球号码大于第五球号码为龙，其余情形为虎。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。
                    <br>
                    如：龙开08、虎开01则投注“龙”者中奖，又如：龙开04、虎开10，则投注“虎”者中奖。
                </dd>
            </dl>
   
        </div>
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>

