<template>
    <div class="report-height problem-main">
        <dl>
            <dt>◎和值</dt>
            <dd>以全部开出的三个号码、加起来的总和来判定。</dd>
            <dd>开奖号码总和值为3、4、5、6、7、8、9、10、11、12、13、14、15、16、17 、18时，即为中奖；</dd>
            <dd>※举例:如开奖号码为1、2、3、总和值为6、则投注「6」即为中奖。</dd>
            <dd>大小：三个开奖号码总和值11~18 为大；总和值3~10 为小。</dd>
            <dd>单双：三个开奖号码总和3、5、7、9、11、13、15、17为单；4、6、8、10、12、14、16、18为双。</dd>
        </dl>
        <dl>
            <dt>◎独胆</dt>
            <dd>三个开奖号码其中一个与所选号码相同时、即为中奖。</dd>
            <dd>※举例: 如开奖号码为1、1、3，则投注独胆1或独胆3皆视为中奖。</dd>
            <dd>※备注：不论当局指定点数出现几次，仅派彩一次(不翻倍)。</dd>
        </dl>
        <dl>
            <dt>◎豹子</dt>
            <dd>豹子：开奖号码三字同号、且与所选择的豹子组合相符时，即为中奖。</dd>
            <dd>任意豹子：任意豹子组合、开奖号码三字同号，即为中奖。</dd>
        </dl>
        <dl>
            <dt>◎对子</dt>
            <dd>开奖号码任两字同号、且与所选择的对子组合相符时，即为中奖。</dd>
            <dd>※举例：如开奖号码为1、1、3、则投注对子1、1，即为中奖。</dd>
        </dl>
        <dl>
            <dt>◎不出号码</dt>
            <dd>开奖号码中不存在你所选数字，即为中奖。  </dd>
            <dd>※举例：如开奖号码为1、2、3、则投注4，即为中奖。</dd>
        </dl>
        <dl>
            <dt>◎跨度</dt>
            <dd>大： 开奖号码中的数字最大数减去最小数结果为3、4、5，即为中奖；</dd>
            <dd>小： 开奖号码中的数字最大数减去最小数结果为0、1、2，即为中奖；</dd>
            <dd>单： 开奖号码中的数字最大数减去最小数结果为1、3、5，即为中奖；</dd>
            <dd>双： 开奖号码中的数字最大数减去最小数结果为0、2、4，即为中奖；</dd>
            <dd>具体跨度值： 开奖号码中的数字最大数减去最小数结果为所选跨度值，即为中奖；</dd>
            <dd>※举例：如开奖号码为1、2、3，跨度2，则投注2，即为中奖。</dd>
        </dl>
        <dl>
            <dt>◎牌点</dt>
            <dd>大： 开奖结果数字相加，若个位数为6-9或者0，即为中奖；  </dd>
            <dd>小： 开奖结果数字相加，若个位数为1-5，即为中奖；</dd>
            <dd>单： 开奖结果数字相加，若个位数为单数，即为中奖；  </dd>
            <dd>双： 开奖结果数字相加，若个位数为双数，即为中奖；  </dd>
            <dd>具体牌点值： 开奖结果数字相加，若个位数为选择的牌点，即为中奖；  </dd>
            <dd>※举例：如开奖号码为3、6、3，相加后和值位12，则投注2，即为中奖。</dd>
        </dl>

        <dl>
            <dt>◎两连</dt>
            <dd>任选一长牌组合、当开奖结果任2码与所选组合相同时，即为中奖。</dd>
            <dd>※举例：如开奖号码为1、2、3、则投注两连12、两连23、两连13皆视为中奖</dd>
        </dl>
        <dl>
            <dt>◎三连</dt>
            <dd>三连号单选： 对所有3个相连的号码（123、234、345、456）中的任意一个进行投注，所选号码开出即中奖；</dd>
            <dd>※举例：如开奖号码为1、2、3、则投注123则中奖；</dd>
        </dl>
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>