<template>
    <div  class="report-height problem-main kg-explain">
        <div class="lottery-title">
            <p>1、第一球 ~ 第八球</p>
        </div>
        <dl>
            <dt>第一球 ~ 第八球:</dt>
            <dd>
                第一球、第二球、第三球、第四球、第五球、第六球、第七球、第八球：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖。
            </dd>
            <dd>※举例:第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。</dd>
        </dl>
        <dl>
            <dt>两面：</dt>
            <dd>单、双：号码为单数叫单,号码为双数叫双。</dd>
            <dd>※举例：如19、5为单；如8、16为双。</dd>
            <dd>大、小：开出之号码大于或等于11为大，小于或等于10为小。</dd>
            <dd>尾大、尾小：开出之尾数大于或等于5为尾大，小于或等于4为尾小。</dd>
            <dd>※说明：每一个号码为一投注组合，假如投注号码为开奖号码并在所投的球位置，视为中奖，其余情形视为不中奖。</dd>
        </dl>
        <dl>
            <dt>中发白：</dt>
            <dd>
                中：开出之号码为01、02、03、04、05、06、07
            </dd>
            <dd>发：开出之号码为08、09、10、11、12、13、14</dd>
            <dd>白：开出之号码为15、16、17、18、19、20</dd>
        </dl>
        <dl>
            <dt>方位：</dt>
            <dd>
                东：开出之号码为01、05、09、13、17
            </dd>
            <dd>南：开出之号码为02、06、10、14、18</dd>
            <dd>西：开出之号码为03、07、11、15、19</dd>
            <dd>北：开出之号码为04、08、12、16、20</dd>
        </dl>
        <div class="lottery-title">
            <p>2、总和</p>
        </div>
        <dl>
            <dt>总和单双：</dt>
            <dd>
                所有8个开奖号码的数字总和值是单数为总和单，如数字总和值是31、51；所有8个开奖号码的数字总和值是双数为总和双，
                如数字总和是42、80；假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>总和大小：</dt>
            <dd>
                所有8个开奖号码的数字总和值85到132为总大；所有8个开奖号码的数字总和值36到83为总分小；所有8个开奖号码的数字总和值为84打和；
                如开奖号码为01、20、02、08、17、09、11，数字总和是68，则总分小。假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖，打和不计算结果
            </dd>
        </dl>
        <dl>
            <dt>总尾大小：</dt>
            <dd>
                所有8个开奖号码的数字总和数值的个位数大于或等于5为总尾大，小于或等于4为总尾小；假如投注组合符合中奖结果，视为中奖，其余情形视为不中奖。
            </dd>
        </dl>
        <div class="lottery-title">
            <p>3、龙虎</p>
        </div>
        <dl>
            <dt>龙：</dt>
            <dd>
                开出之号码第一球的中奖号码大于第八球的中奖号码。如 第一球开出14 第八球开出09；第一球开出17 第八球开出08；第一球开出05 第八球开出01...中奖为龙。
            </dd>
            <dt>虎：</dt>
            <dd>
                开出之号码第一球的中奖号码小于第八球的中奖号码。如 第一球开出14 第八球开出16；第一球开出13 第八球开出18；第一球开出05 第八球开出08...中奖为虎。
            </dd>
        </dl>
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>