<template>
    <div  class="report-height problem-main kg-explain">
        <div class="lottery-title">
            <p>六合彩规则说明</p>
        </div>
        <dl>
            <dt>以下所有投注皆含本金。</dt>
            <dt>特别号码盘势规则说明</dt>
            <dt>当期开出的最后一码为特别号或特码。</dt>
            <dt>特码　单　码：</dt>
            <dd>假设投注号码为开奖号码之特别号，视为中奖，其余情形视为不中奖。</dd>
            <dt>特码　大　小：</dt>
            <dd>开出之特码大于或等于25为特码大， 小于或等于24为特码小，开出49为和。</dd>
            <dt>特码　单　双：</dt>
            <dd>特码为双数叫特双，如8、16；特码为单数叫特单，如21、35，开出49为和。</dd>
            <dt>特码和数大小：</dt>
            <dd>以特码个位和十位数字之和来判断胜负，和数大于或等于7为大，小于或等于6为小，开出49号为和。</dd>
            <dt>特码和数单双：</dt>
            <dd>以特码个位和十位数字之和来判断单双，如01，12，32为和单，02，11，33为和双，开出49号为和。</dd>
            <dt>特码尾数大小：</dt>
            <dd>以特别号尾数若0尾~4尾为小、5尾~9尾为大；如01、32、44为特尾小；如05、18、19为特尾大，开出49号为和</dd>
            <dt>特码　半　特：</dt>
            <dd>以特别号大小与特别号单双游戏为一个投注组合；当期特别号开出符合投注组合，即视为中奖；若当期特码开出49号，则视为和局；其余情形视为不中奖</dd>
        </dl>
        <dl>
            <dt>两面规则说明：指大、小；单、双。</dt>
            <dd>每期六合彩开奖球数共七粒(包括特码)。</dd>
            <dt>正码：</dt>
            <dd>当期开出之前6个号码叫正码。每一个号码为一投注组合，假如投注号码为开奖号码之 正码，视为中奖，其馀情形视为不中奖。</dd>
        </dl>
        <div class="lottery-title">
            <p>正码1-6盘势规则说明</p>
        </div>
        <dl>
            <dd>当期开出之前6个号码叫正码。第一时间出来的叫正码1，依次为正码2、正码3…… 正码6(并不以号码大小排序)。</dd>
            <dt>大　　小：</dt>
            <dd>以指定出现正码的位置与号码大于或等于25为大，小于或等于24为小，开出49为和。</dd>
            <dt>单　　双：</dt>
            <dd>以指定出现正码的位置与号码为单数或双数下注，开出49为和。</dd>
            <dt>和数大小：</dt>
            <dd>以指定出现正码的位置与号码个位和十位数字总和来判断胜负，和数大于或等于7为大，小于或等于6为小，开出49号为和。</dd>
            <dt>和数单双：</dt>
            <dd>以指定出现正码的位置与号码个位和十位数字总和来判断单双，开出49号为和。</dd>
            <dt>色　　波：</dt>
            <dd>以指定出现正码的位置的球色下注，开奖之球色与下注之颜色相同时，视为中奖，其余情形视为不中奖。</dd>
            <dt>尾数大小：</dt>
            <dd>以指定出现正码的位置与号码尾数大小下注，若0尾~4尾为小、5尾~9尾为大。如01、32、44为正尾小；如05、18、19为正尾大，开出49号为和</dd>
        </dl>
        <div class="lottery-title">
            <p>正码特规则说明</p>
        </div>
        <dl>
            <dd>正码特是指 正1特、正2特、正3特、正4特、正5特、正6特：其下注的正码特号与现场摇珠开出之正码其开奖顺序及开奖号码相同，视为中奖，
                如现场摇珠第一个正码开奖为49号，下注第一个正码特为49则视为中奖，其它号码视为不中奖。</dd>
            <dt>总和单双 ：</dt>
            <dd>
                所有七个开奖号码的分数总和是单数叫(总分单)，如分数总和是115、183；分数总和是双数叫(总 分双)，
                如分数总和是108、162。假如投注组合符合中奖结果，视为中奖，其馀情形视为不中奖 。
            </dd>
            <dt>总和大小 ：</dt>
            <dd>
                六个开奖正码的分数总和大于或等于150为总分大；分数总和小于或等于149为总分小。
                如开奖号码为02、08、17、28、39、46、25，分数总和是165，则总分小。假如投注组合符合 中奖结果，视为中奖，其馀情形视为不中奖。
            </dd>
        </dl>
        <div class="lottery-title">
            <p>连码规则说明</p>
        </div>
        <dl>
            <dt>1·四全中：</dt>
            <dd>所投注的每四个号码为一组合，若四个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如06、07、08、09四个都是开奖号码之正码，视为中奖，
                如三个正码加上一个特别号码视为不中奖。</dd>
            <dt>2·三中二：</dt>
            <dd>
                所投注的每三个号码为一组合，若其中2个是开奖号码中的正码，即为三中二，视为中奖； 若3个都是开奖号码中的正码，即为三中二之中三，其馀情形视为不中奖，
                如06、07、08 为一组合，开奖号码中有06、07两个正码，没有08，
                即为三中二，按三中二赔付；如开奖 号码中有06、07、08三个正码，即为三中二之中三，按中三赔付；如出现1个或没有，视 为不中奖 。
            </dd>
            <dt>3·三全中：</dt>
            <dd>所投注的每三个号码为一组合，若三个号码都是开奖号码之正码，视为中奖，其馀情形视为 不中奖。如06、07、08三个都是开奖号码之正码，视为中奖，
                如两个正码加上一个特别号 码视为不中奖 。</dd>
            <dt>4·二全中：</dt>
            <dd>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，视为中奖，其馀情形视为不 中奖（含一个正码加一个特别号码之情形）。</dd>
            <dt>5·二中特：</dt>
            <dd>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，叫二中特之中二；若其中一 个是正码，一个是特别号码，叫二中特之中特；其馀情形视为不中奖 。</dd>
            <dt>6·特串：</dt>
            <dd>所投注的每二个号码为一组合，其中一个是正码，一个是特别号码，视为中奖，其馀情形视为 不中奖（含二个号码都是正码之情形） 。</dd>
            <dt>7.依照二全中·二中特·特串</dt>
            <dd>此3种玩法规则,来进行‘生肖对碰’或‘尾数对碰’</dd>
        </dl>
        <dl>
            <dt>例一：</dt>
            <dd>选择‘二全中’,之后进行‘生肖对碰’选择马(2，14，26，38)以及羊 (1，13，25，37，49)则会产生20组号码组合：</dd>
            <dd>[2,1] [2,13] [2,25] [2,37] [2,49]</dd>
            <dd>[14,1] [14,13] [14,25] [14,37] [14,49]</dd>
            <dd>[26,1] [26,13] [26,25] [26,37] [26,49]</dd>
            <dd>[38,1] [38,13] [38,25] [38,37] [38,49]</dd>
        </dl>
        <dl>
            <dt>例二：</dt>
            <dd>选择‘二中特’,之后进行‘尾数对碰’选择0(10，20，30，40)以及5(5，15，25，35，45)则会产生20组号码组合：</dd>
            <dd>[10,5] [10,15] [10,25] [10,35] [10,45]</dd>
            <dd>[20,5] [20,15] [20,25] [20,35] [20,45]</dd>
            <dd>[30,5] [30,15] [30,25] [30,35] [30,45]</dd>
            <dd>[40,5] [40,15] [40,25] [40,35] [40,45]</dd>
        </dl>
        <dl>
            <dt>肖串尾数 ：</dt>
            <dd>
                选择一主肖，可扥0-9尾的球． 以三全中的肖串尾数为例： 选择【蛇】当主肖(号码03,15,27,39)并且扥9尾数．因为9尾数中的39已在主肖中出现，
                将不重复组合． 故龙主肖扥9尾数共可组合出24种组合(二个尾数号码+一个主肖号码的组合)．
            </dd>
            <dt>正码过关 ：</dt>
            <dd>
                游戏规则同正码1-6盘势，但须同时投注多项结果，串联成投注组合，只要单期所开出之开奖结果符合您所选定之串联结果，即视为中奖，
                若其中一项结果不中，则视为不中奖；若其中一项结果为和，其余结果都中奖的情形，也视为中奖；和的项目赔率以一计算
            </dd>
            <dt>生肖色波 ：</dt>
            <dd>分为生肖与色波两种玩法</dd>
        </dl>
        <div class="lottery-title">
            <p>特码生肖规则说明</p>
        </div>
        <dl>
            <dt>生肖顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪</dt>
            <dd>如今年是猪年，就以猪为开始，依顺序将49个号码分为12个生肖(如下)，再以生肖下注。</dd>
            <dd>猪 01 , 13 , 25 , 37 , 49</dd>
            <dd>鼠 12 , 24 , 36 , 48</dd>
            <dd>牛 11 , 23 , 35 , 47</dd>
            <dd>虎 10 , 22 , 34 , 46</dd>
            <dd>兔 09 , 21 , 33 , 45</dd>
            <dd>龙 08 , 20 , 32 , 44</dd>
            <dd>蛇 07 , 19 , 31 , 43</dd>
            <dd>马 06 , 18 , 30 , 42</dd>
            <dd>羊 05 , 17 , 29 , 41</dd>
            <dd>猴 04 , 16 , 28 , 40</dd>
            <dd>鸡 03 , 15 , 27 , 39</dd>
            <dd>狗 02 , 14 , 26 , 38</dd>
            <dd>若当期特别号，落在下注生肖范围内，视为中奖 。</dd>
        </dl>
        <div class="lottery-title">
            <p>色波规则说明</p>
        </div>
        <dl>
            <dd>以特别号的球色下注，开奖的球色与下注的颜色相同，视为中奖，球色号码分布如下:</dd>
            <dd>
                红波: <span style="color: red">01 02 07 08 12 13 18 19 23 24 29 30 34 35 40 45 46</span>
            </dd>
            <dd>
                蓝波: <span style="color: blue">03 04 09 10 14 15 20 25 26 31 36 37 41 42 47 48</span>
            </dd>
            <dd>
                绿波: <span style="color: green">05 06 11 16 17 21 22 27 28 32 33 38 39 43 44 49</span>
            </dd>
        </dl>
        <div class="lottery-title">
            <p>一肖规则说明</p>
        </div>
        <dl>
            <dd>将生肖依序排列，例如今年是猪年，就以猪为开始，依顺序将49个号码分为12个生肖(如下)，再以生肖下注。</dd>
            <dd>猪 01 , 13 , 25 , 37 , 49</dd>
            <dd>鼠 12 , 24 , 36 , 48</dd>
            <dd>牛 11 , 23 , 35 , 47</dd>
            <dd>虎 10 , 22 , 34 , 46</dd>
            <dd>兔 09 , 21 , 33 , 45</dd>
            <dd>龙 08 , 20 , 32 , 44</dd>
            <dd>蛇 07 , 19 , 31 , 43</dd>
            <dd>马 06 , 18 , 30 , 42</dd>
            <dd>羊 05 , 17 , 29 , 41</dd>
            <dd>猴 04 , 16 , 28 , 40</dd>
            <dd>鸡 03 , 15 , 27 , 39</dd>
            <dd>狗 02 , 14 , 26 , 38</dd>
            <dd>只要当期号码(所有正码与最后开出的特码)，落在下注生肖范围内，则视为中奖。(请注意：49亦算输赢，不为和)。</dd>
        </dl>
        <dl>
            <dt>合肖 ：</dt>
            <dd>
                选1~11生肖(排列如同生肖)为一组合，并选择开奖号码的特码是否在此组合内，若选择是"中"(可选择2~11个生肖)且开奖号码的特码亦在此组合内，即视为中奖；
                若选择否"不中"(可选择1~10个生肖),系统会将选择不中的组合改为中的组合；若当期特码开出49号，则所有组合皆视为和局
            </dd>
            <dt>超快速模式 ：</dt>
            <dd>
                在此模式下所投注的注单，若是赔率变动时，系统将不会有赔率已变动的讯息提示，而会以投注当时的最新赔率接受投注。 例：使用超快速模式投注特别号，输入金额时，赔率为41.5倍，
                金额输入的过程中赔率已更新为41倍，金额输入完毕，确认投注时，注单上所显示的赔率将会是以41倍接受投注，当下投注画面上亦会更新为最新赔率。
            </dd>
            <dt>半波 ：</dt>
            <dd>
                以特码色波和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其馀情形视为不中奖。
            </dd>
            <dt>半半波 ：</dt>
            <dd>以特码色波和特码单双及特码大小等三种游戏为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其馀情形视为不中奖。</dd>
            <dt>正肖 ：</dt>
            <dd>依据开出的所有正码为主。若当期6个正码，只要有1个落在下注生肖范围内，视为中奖。如超过1个正码落在下注生肖范围内 ，派彩将倍增！</dd>
            <dd>如：下注＄100.-正肖马赔率1.88</dd>
            <dd>6个正码开出01，派彩为＄88.-</dd>
            <dd>6个正码开出01，13，派彩为＄176.-</dd>
            <dd>6个正码开出01，13，25，派彩为＄264.-</dd>
            <dd>6个正码开出01，13，25，37，派彩为＄352.-</dd>
            <dd>6个正码开出01，13，25，37，49，派彩为＄440.-(请注意：49亦算输赢，不为和)</dd>
        </dl>
        <dl>
            <dt>特码头数 ：</dt>
            <dd>指特别号所属头数的号码</dd>
            <dt>"0"头 ：</dt>
            <dd>01，02，03，04，05，06，07，08，09</dd>
            <dt>"1"头 ：</dt>
            <dd>10，11，12，13，14，15，16，17，18，19</dd>
            <dt>"2"头 ：</dt>
            <dd>20，21，22，23，24，25，26，27，28，29</dd>
            <dt>"3"头 ：</dt>
            <dd>30，31，32，33，34，35，36，37，38，39</dd>
            <dt>"4"头 ：</dt>
            <dd>40，41，42，43，44，45，46，47，48，49</dd>
            <dd>例如 ：开奖结果特别号码是21则 "2"头为中奖，其他头数都不中奖</dd>
            <dt>特码尾数</dt>
            <dd>指特别号所属尾数的号码</dd>
            <dt>"1"尾 ：</dt>
            <dd>01，11，21，31，41</dd>
            <dt>"2"尾 ：</dt>
            <dd>02，12，22，32，42</dd>
            <dt>"3"尾 ：</dt>
            <dd>03，13，23，33，43</dd>
            <dt>"4"尾 ：</dt>
            <dd>04，14，24，34，44</dd>
            <dt>"5"尾 ：</dt>
            <dd>05，15，25，35，45</dd>
            <dt>"6"尾 ：</dt>
            <dd>06，16，26，36，46</dd>
            <dt>"7"尾 ：</dt>
            <dd>07，17，27，37，47</dd>
            <dt>"8"尾 ：</dt>
            <dd>08，18，28，38，48</dd>
            <dt>"9"尾 ：</dt>
            <dd>09，19，29，39，49</dd>
            <dt>"0"尾 ：</dt>
            <dd>10，20，30，40</dd>
            <dd>例如 ：开奖结果特别号码是21则 "1"尾为中奖，其他尾数都不中奖</dd>
        </dl>
        <dl>
            <dt>平特尾数 ：</dt>
            <dd>只要当期号码(所有正码及开出来的特码)，含所属尾数的一个或多个号码，但派彩只派一次，即不论同尾数号码出现一个或多个号码都只派彩一次。</dd>
            <dt>"1"尾：</dt>
            <dd>01.11.21.31.41 </dd>
            <dt>"2"尾：</dt>
            <dd>02.12.22.32.42</dd>
            <dt>"3"尾：</dt>
            <dd>03.13.23.33.43</dd>
            <dt>"4"尾：</dt>
            <dd>04.14.24.34.44</dd>
            <dt>"5"尾：</dt>
            <dd>05.15.25.35.45</dd>
            <dt>"6"尾：</dt>
            <dd>06.16.26.36.46</dd>
            <dt>"7"尾：</dt>
            <dd>07.17.27.37.47</dd>
            <dt>"8"尾：</dt>
            <dd>08.18.28.38.48</dd>
            <dt>"9"尾：</dt>
            <dd>09.19.29.39.49</dd>
            <dt>"0"尾：</dt>
            <dd>10.20.30.40</dd>
            <dd>例如 ：开奖结果正码是11、31、42、44、35、32特别号码是 21 则"1"尾"2"尾"4"尾"5"尾都为中奖，其他尾数都不中奖。</dd>
        </dl>
        <dl>
            <dt>总肖 ：</dt>
            <dd>当期号码(所有正码与最后开出的特码)开出的不同生肖总数，与所投注之预计开出之生肖总数和(不用指定特定生肖)，则视为中奖，其余情形视为不中奖。
                例如：如果\'当期号码为19、24、12、34、40、39 特别号：49，总计六个生肖，若选总肖【6】则为中奖 (请注意：49号亦算输赢，不为和)</dd>
            <dt>总肖单双 ：</dt>
            <dd>当期号码(所有正码与最后开出的特码)开出的不同生肖总数若为单数则为单；若为双数则为双。例如当期号码为19、24、12、34、40、39.
                特码：49，则总计六个生肖，若下双则中奖。</dd>
            <dt>连肖 ：</dt>
            <dd>挑选2~6生肖(排列如同生肖)为一个组合，当期号码(所有正码与最后开出的特码)坐落于投注时所勾选之生肖组合所属号码内，
                所勾选之生肖皆至少有中一个号码，则视为中奖，其余情视为不中奖(请注意49亦算输赢，不为和)</dd>
            <dd>例如：如果当期号码为19、24、12、34、40、39.特码：49，所勾选三个生肖(称为三肖碰)，若所有生肖的所属号码内至少一个出现于当期号码，则视为中奖。</dd>
            <dt>连尾 ：</dt>
            <dd>挑选2〜6个尾数为一组合，当期号码（所有正码与最后出的特码）坐落于投注时所勾选之尾数组合所属号码内，则视为中奖，其余情形视为不中奖(请注意49亦算输赢，不为和)</dd>
            <dd>举例1：下注2尾碰，勾选0,1，当期七个号码若0尾及1尾皆有开出，视为中奖</dd>
            <dd>举例2：下注2尾碰，勾选0,1,2三种尾数，会出现三种组合（组合一：0,1）（组合二：0,2）（组合三：1,2），当期七个号码若开出其中一种组合所选的两个尾数，视为中奖。</dd>
            <dt>自选不中奖 ：</dt>
            <dd>
                挑选5~12个号码为一个组合，当期号码(所有正码与最后开出的特码)皆没有坐落于投注时所挑选之号码组合内，则视为中奖，
                若是有任何一个当期号码开在所挑选的号码组合情形视为不中奖。</dd>
            <dd>
                例如当期号码为19,24,17,34,40,39,特别号49，所挑选5个号码(称为五不中)，若所挑选的号码内皆沒有坐落于当期号码，则为中奖
            </dd>
        </dl>
        <dl>
            <dt>胆拖 ：</dt>
            <dd>选择胆码（最多三个）以及选择拖码，让他们组合成投注内容（右边窗口展现）。 </dd>
            <dd>例如选择了二全中，胆码选择了41,42，拖码选择了02,03，那就组合成（41,02），（41,03），（42,02），（42,03）四组投注选项。</dd>
        </dl>
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>