<template>
    <div class="report-height problem-main">
        <dl>
            <dt>1、第一球 ~ 第五球</dt>
            <dd>
                第一球、第二球、第三球、第四球、第五球：指下注的每一球特码与开出之号码其开奖顺序及开奖号码相同，视为中奖，
                如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>单双大小</dt>
            <dd>
                根据相应单项投注第一球 ~ 第五球开出的球号，判断胜负。
            </dd>
        </dl>
        <dl>
            <dt>大小</dt>
            <dd>
                根据相应单项投注的第一球 ~ 第五球开出的球号大于或等于 5 为特码大，小于或等于 4 为特码小。
            </dd>
        </dl>
        <dl>
            <dt>单双</dt>
            <dd>
                根据相应单项投注的第一球 ~ 第五球开出的球号为双数则为特码双，如 2、6；球号为单数则为特码单，如 1、3。
            </dd>
        </dl>
        <dl>
            <dt>斗牛：开奖号码不分顺序</dt>
            <dd>
                <b>牛牛</b>：
                根据开奖第一球 ~ 第五球开出的球号数字为基础，任意组合三个号码成0或10的倍数，取剩余两个号码之和为点数（大于10时减去10后的数字作为对奖基数，
                如：00026为牛8，02818为牛9，68628、23500皆为牛10俗称牛牛；26378、15286因任意三个号码都无法组合成0或10的倍数，
                称为没牛，注：当五个号码相同时，只有00000视为牛牛，其它11111，66666等皆视为没牛）<br>
                <b>大小</b>：
                牛大(牛6,牛7,牛8,牛9,牛牛)，牛小(牛1,牛2,牛3,牛4,牛5)，若开出斗牛结果为没牛，则投注牛大牛小皆为不中奖。<br>
                <b>单双</b>：
                牛单(牛1,牛3,牛5,牛7,牛9)，牛双(牛2,牛4,牛6,牛8,牛牛)，若开出斗牛结果为没牛，则投注牛单牛双皆为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>梭哈：开奖号码不分顺序</dt>
            <dd>
                <b>五条</b>：
                开奖的五个号码全部相同，例如：22222、66666、88888 投注梭哈：五条 中奖，其它不中奖。<br>
                <b>四条</b>：开奖的五个号码中有四个号码相同，例如：22221、66663、88885 投注梭哈：四条 中奖，其它不中奖。<br>
                <b>葫芦</b>：开奖的五个号码中有三个号码相同(三条)另外两个号码也相同(一对)，例如：22211、66633 投注梭哈：葫芦 中奖，其它不中奖。<br>
                <b>顺子</b>：开奖的五个号码从小到大排列为顺序(号码9、0、1相连)，例如：23456、89012、90123 投注梭哈：顺子 中奖，其它不中奖。<br>
                <b>三条</b>：开奖的五个号码中有三个号码相同另外两个不相同，例如：22231、66623、88895 投注梭哈：三条 中奖，其它不中奖。<br>
                <b>两对</b>：开奖的五个号码中有两组号码相同，例如：22166、66355、82668 投注梭哈：两对 中奖，其它不中奖。<br>
                <b>一对</b>：开奖的五个号码中只有一组号码相同，例如：22168、66315、82968 投注梭哈：一对 中奖，其它不中奖。<br>
                <b>散号</b>：开奖号码不是五条、四条、葫芦、三条、顺子、两对、一对的其它所有开奖号码，例如：23186、13579、21968 投注梭哈：散号 中奖，其它不中奖。
            </dd>
        </dl>
        <dl>
            <dt>2、总和</dt>
            <dt>大小</dt>
            <dd>
                根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值大于或等于 23 为总和大，小于或等于 22 为总和小。
            </dd>
        </dl>
        <dl>
            <dt>单双</dt>
            <dd>
                根据相应单项投注的第一球 ~ 第五球开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。
            </dd>
        </dl>
        <dl>
            <dt>3、前三特殊玩法： 豹子 &gt; 顺子 &gt; 对子 &gt; 半顺 &gt; 杂六</dt>
            <dt>豹子</dt>
            <dd>
                开奖号码的万位千位百位数字都相同。如中奖号码为：222XX、666XX、888XX...开奖号码的万位千位百位数字相同，
                则投注前三豹子者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>顺子</dt>
            <dd>
                开奖号码的万位千位百位数字都相连，不分顺序（数字9、0、1相连）。
                如中奖号码为：123XX、901XX、321XX、798XX...开奖号码的万位千位百位数字相连，则投注前三顺子者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>对子</dt>
            <dd>
                开奖号码的万位千位百位任意两位数字相同（不包括豹子）。如中奖号码为：001XX，288XX、696XX...开奖号码的万位千位百位有两位数字相同，
                则投注前三对子者视为中奖，其它视为不中奖。如果开奖号码为前三豹子，则前三对子视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>半顺</dt>
            <dd>
                开奖号码的万位千位百位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：125XX、540XX、390XX、160XX...开奖号码的万位千位百位有两位数字相连，
                则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，
                则前三半顺视为不中奖。如开奖号码为：123XX、901XX、556XX、233XX...视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>杂六</dt>
            <dd>
                不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：157XX、268XX...开奖号码位数之间无关联性，
                则投注前三杂六者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>4、中三特殊玩法： 豹子 &gt; 顺子 &gt; 对子 &gt; 半顺 &gt; 杂六</dt>
            <dt>豹子</dt>
            <dd>
                开奖号码的千位百位十位数字都相同。
                如中奖号码为：X222X、X666X、X888X...开奖号码的万位千位百位数字相同，则投注中三三豹子者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>顺子</dt>
            <dd>
                开奖号码的千位百位十位数字都相连，不分顺序（数字9、0、1相连）。
                如中奖号码为：X123X、X901X、X321XX、X798X...开奖号码的万位千位百位数字相连，则投注中三三顺子者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>对子</dt>
            <dd>
                开奖号码的千位百位十位任意两位数字相同（不包括豹子）。
                如中奖号码为：XX11X，X88XX、X696X...开奖号码的万位千位百位有两位数字相同，
                则投注中三三对子者视为中奖，其它视为不中奖。如果开奖号码为中三豹子，则中三对子视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>半顺</dt>
            <dd>
                开奖号码的千位百位十位任意两位数字相连，不分顺序（不包括顺子、对子）。
                如中奖号码为：X125X、X540X、X390X、X160X...开奖号码的千位百位十位有两位数字相连，则投注中三半顺者视为中奖，其它视为不中奖。
                则投注中三半顺者视为中奖，其它视为不中奖。如果开奖号码为中三顺子、中三对子，则中三半顺视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>杂六</dt>
            <dd>
                不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：X157X、X268X...开奖号码位数之间无关联性，则投注中三杂六者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>5、后三特殊玩法： 豹子 &gt; 顺子 &gt; 对子 &gt; 半顺 &gt; 杂六</dt>
            <dt>豹子</dt>
            <dd>
                开奖号码的百位十位个位数字都相同。如中奖号码为：
                XX222、XX666、XX888...开奖号码的百位十位个位数数字相同，则投注后三豹子者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>顺子</dt>
            <dd>
                开奖号码的百位十位个位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：
                XX123、XX901、XX321、XX798...开奖号码的百位十位个位数数字相连，则投注后三顺子者视为中奖，其它视为不中奖
            </dd>
        </dl>
        <dl>
            <dt>对子</dt>
            <dd>
                开奖号码的百位十位个位任意两位数字相同（不包括豹子）。如中奖号码为：XX001，XX288、XX696...开奖号码的百位十位个位数有两位数字相同，
                则投注后三对子者视为中奖，其它视为不中奖。如果开奖号码为后三豹子，则后三对子视为不中奖
            </dd>
        </dl>
        <dl>
            <dt>半顺</dt>
            <dd>
                开奖号码的百位十位个位任意两位数字相连，不分顺序（不包括顺子、对子）。
                如中奖号码为：XX125、XX540、XX390、XX160...开奖号码的百位十位个位数有两位数字相连，
                则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，
                则前三半顺视为不中奖。如开奖号码为：123XX、901XX、556XX、233XX...视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>杂六</dt>
            <dd>
                不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：XX157、XX268...开奖号码位数之间无关联性，
                则投注前三杂六者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>6、龙虎和特殊玩法： 龙 &gt; 虎 &gt; 和 （0为最小，9为最大）</dt>
            <dt>龙</dt>
            <dd>
                开奖第一球（万位）的号码 大于 第五球（个位）的号码。如：第一球开出 6，第五球开出
                2、第一球开出 8，第五球开出 6、第一球开出 5，第五球开出 1...开奖为龙，投注龙者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>虎</dt>
            <dd>
                开奖第一球（万位）的号码 小于 第五球（个位）的号码。如：
                第一球开出 2，第五球开出 6、第一球开出 6，第五球开出 8、第一球开出 1，
                第五球开出 5...开奖为虎，投注虎者视为中奖，其它视为不中奖。
            </dd>
        </dl>
        <dl>
            <dt>和</dt>
            <dd>
                开奖第一球（万位）的号码 等于 第五球（个位）的号码。
                如：2XXX2、6XXX6、8XXX8...开奖为和，投注和者视为中奖，其它视为不中奖。
            </dd>
        </dl>

        <dl>
            <dt>两面玩法</dt>
            <dd>
                开奖结果万位、仟位、佰位、拾位或个位数字为1、3、5、7、9时为“单”，若为0、2、4、6、8时为“双”，当投注位数单双与开奖结果的位数单双相符时，即为中奖。
            </dd>
            <dd>
                ※举例:投注者购买佰位单，当期开奖结果如为20130（1为单），则视为中奖。
            </dd>
            <dd>
                <div class="kg-explain-table">
                    <ul class="display-box">
                        <li>单</li>
                        <li>双</li>
                    </ul>
                    <ul class="display-box">
                        <li>1、 3、 5、 7、 9</li>
                        <li>0、 2、 4、 6、 8</li>
                    </ul>
                </div>
            </dd>
        </dl>
        <dl>
            <dt>◎大小玩法说明</dt>
            <dd>
                开奖结果万位、仟位、佰位、拾位或个位数字为5、6、7、8、9时为“大”，若为0、1、2、3、4时为“小”，当投注位数大小与开奖结果的位数大小相符时，即为中奖。
            </dd>
            <dd>
                ※举例：投注者购买佰位小，当期开奖结果如为20352（3为小），则视为中奖。
            </dd>
            <dd>
                <div class="kg-explain-table">
                    <ul class="display-box">
                        <li>大</li>
                        <li>小</li>
                    </ul>
                    <ul class="display-box">
                        <li>5、 6、 7、 8、 9</li>
                        <li>0、 1、 2、 3、 4</li>
                    </ul>
                </div>
            </dd>
        </dl>
        <dl>
            <dt>◎龙虎和玩法说明</dt>
            <dd>龙：开出之号码第一球(万位)的中奖号码大于第五球(个位)的中奖号码，</dd>
            <dd>如出和局为打和。</dd>
            <dd>
                如：第一球开出4，第五球开出2； 第一球开出9，第五球开出8； 第一球开出5，第五球开出1...中奖为龙。
            </dd>
            <dd>
                虎：开出之号码第一球(万位)的中奖号码小于第五球(个位)的中奖号码，
            </dd>
            <dd>如出和局为打和。</dd>
            <dd>如：第一球开出7，第五球开出9； 第一球开出3，第五球开出5； 第一球开出5，第五球开出8...中奖为虎。</dd>
            <dd>和：开出之号码第一球(万位)的中奖号码等于第五球(个位)的中奖号码 </dd>
            <dd>如：2***2则投注和局者视为中奖，其他视为不中奖。</dd>
        </dl>
        <dl>
            <dt>◎总和玩法说明</dt>
            <dd>总大：开奖结果5个号码加起的总和，大于等于23为总大。</dd>
            <dd>※举例：投注者购买总和大，当期开奖结果如为总数为28，则视为中奖。</dd>
            <dd>总小：开奖结果5个号码加起的总和，小于等于22为总小。</dd>
            <dd>※举例：投注者购买总和小，当期开奖结果如为总数为18，则视为中奖。</dd>
            <dd>总单：开奖结果5个号码加起的总和为单数。</dd>
            <dd>※举例：投注者购买总和单，当期开奖结果如为总数为29，则视为中奖。</dd>
            <dd>总双：开奖结果5个号码加起的总和为双数。</dd>
            <dd>※举例：投注者购买总和双，当期开奖结果如为总数为18，则视为中奖。</dd>
        </dl>
        <dl>
            <dt>7、一字组合</dt>
            <dt>全五：</dt>
            <dd>
               从0-9共10个号码中选择1个号码组成1注，当期所有5个开奖号码中包含所选号码，视为中奖，其余情形视为未中奖。 
               如果超过1个开奖号码与所选号码相同，奖金将倍增，派彩公式为：投注金额 X 赔率 + 投注金额 X (赔率 - 1) X (中奖号码个数 - 1)。 
            </dd>
            <dd>如：投注一字组合 5，投注金额 10元，赔率 1.8，开奖号码 2 3 4 5 6，则中奖派彩 10 * 1.8 + 10 * (1.8 - 1) * (1 - 1) = 18元， 
                开奖号码 2 3 4 5 5，则中奖派彩 10 * 1.8 + 10 * (1.8 - 1) * (2 - 1) = 26元，开奖号码 2 5 4 5 5， 
                则中奖派彩 10 * 1.8 + 10 * (1.8 - 1) * (3 - 1) = 34元。
            </dd>
        </dl>
        <dl>
            <dt>8、跨度</dt>
            <dt>前三跨度：</dt>
            <dd>
                当期所有5个开奖号码中万、千、百位的最大差距（跨度）。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。 
                如：投注前三跨度 5，开奖结果 3 4 8 7 6 即为中奖（万、千、百位开奖号码 3 4 8，跨度 = 最大号码 - 最小号码，即 8 - 3 = 5）。
            </dd>

            <dt>中三跨度：</dt>
            <dd>
                当期所有5个开奖号码中千、百、十位的最大差距（跨度）。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。 
                如：投注中三跨度 4，开奖结果 3 4 8 7 6 即为中奖（千、百、十位开奖号码 4 8 7，跨度 = 最大号码 - 最小号码，即 8 - 4 = 4）。
            </dd>

            <dt>后三跨度：</dt>
            <dd>
                当期所有5个开奖号码中百、十、个位的最大差距（跨度）。若投注内容符合当期开奖结果，视为中奖，其余情形视为未中奖。 
                如：投注后三跨度 2，开奖结果 3 4 8 7 6 即为中奖（百、十、个位开奖号码 8 7 6，跨度 = 最大号码 - 最小号码，即 8 - 6 = 2）。
            </dd>
        </dl>
     
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>