<template>
    <div  class="report-height problem-main kg-explain">
        <div class="lottery-title">
            <p>幸运星座规则说明</p>
        </div>
        <dl>
            <dt>以下所有投注皆含本金。</dt>
            <dt>特别号码盘势规则说明</dt>
            <dt>当期开出的最后一码为特别号或特码。</dt>
            <dt>特码　单　码：</dt>
            <dd>假设投注号码为开奖号码之特别号，视为中奖，其余情形视为不中奖。</dd>
            <dt>特码　大　小：</dt>
            <dd>开出之特码大于或等于19为特码大， 小于或等于18为特码小。</dd>
            <dt>特码　单　双：</dt>
            <dd>特码为双数叫特双，如8、16；特码为单数叫特单，如21、35。</dd>
            <dt>特码和数大小：</dt>
            <dd>以特码个位和十位数字之和来判断胜负，和数大于或等于7为大，小于或等于6为小。</dd>
            <dt>特码和数单双：</dt>
            <dd>以特码个位和十位数字之和来判断单双，如01，12，32为和单，02，11，33为和双。</dd>
            <dt>特码尾数大小：</dt>
            <dd>以特别号尾数若0尾~4尾为小、5尾~9尾为大；如01、22、34为特尾小；如05、18、19为特尾大</dd>
            <dt>特码　半　特：</dt>
            <dd>以特别号大小与特别号单双游戏为一个投注组合；当期特别号开出符合投注组合，即视为中奖；其余情形视为不中奖</dd>
        </dl>
        <dl>
            <dt>两面规则说明：指大、小；单、双。</dt>
            <dd>每期六合彩开奖球数共七粒(包括特码)。</dd>
            <dt>正码：</dt>
            <dd>当期开出之前6个号码叫正码。每一个号码为一投注组合，假如投注号码为开奖号码之 正码，视为中奖，其馀情形视为不中奖。</dd>
        </dl>
        <div class="lottery-title">
            <p>正码1-6盘势规则说明</p>
        </div>
        <dl>
            <dd>当期开出之前6个号码叫正码。第一时间出来的叫正码1，依次为正码2、正码3…… 正码6(并不以号码大小排序)。</dd>
            <dt>大　　小：</dt>
            <dd>以指定出现正码的位置与号码大于或等于19为大，小于或等于18为小。</dd>
            <dt>单　　双：</dt>
            <dd>以指定出现正码的位置与号码为单数或双数下注。</dd>
            <dt>和数大小：</dt>
            <dd>以指定出现正码的位置与号码个位和十位数字总和来判断胜负，和数大于或等于7为大，小于或等于6为小。</dd>
            <dt>和数单双：</dt>
            <dd>以指定出现正码的位置与号码个位和十位数字总和来判断单双。</dd>
            <dt>色　　波：</dt>
            <dd>以指定出现正码的位置的球色下注，开奖之球色与下注之颜色相同时，视为中奖，其余情形视为不中奖。</dd>
            <dt>尾数大小：</dt>
            <dd>以指定出现正码的位置与号码尾数大小下注，若0尾~4尾为小、5尾~9尾为大。如01、32、34为正尾小；如05、18、19为正尾大</dd>
        </dl>
        <div class="lottery-title">
            <p>正码特规则说明</p>
        </div>
        <dl>
            <dd>正码特是指 正1特、正2特、正3特、正4特、正5特、正6特：其下注的正码特号与现场摇珠开出之正码其开奖顺序及开奖号码相同，视为中奖， 
                如现场摇珠第一个正码开奖为36号，下注第一个正码特为36则视为中奖，其它号码视为不中奖。</dd>
            <dt>总和单双 ：</dt>
            <dd>
                 所有七个开奖号码的分数总和是单数叫(总分单)，如分数总和是75、83；分数总和是双数叫(总 分双)，如分数总和是108、122。
                 假如投注组合符合中奖结果，视为中奖，其馀情形视为不中奖 。
            </dd>
            <dt>总和大小 ：</dt>
            <dd>
               六个开奖正码的分数总和大于或等于112为总分大；分数总和小于或等于111为总分小。 如开奖号码为08、17、28、36、26、25，分数总和是140，
               则总分大。假如投注组合符合 中奖结果，视为中奖，其馀情形视为不中奖。
            </dd>
        </dl>
        <div class="lottery-title">
            <p>连码规则说明</p>
        </div>
        <dl>
            <dt>1·四全中：</dt>
            <dd> 所投注的每四个号码为一组合，若四个号码都是开奖号码之正码，视为中奖，其余情形视为不中奖。如06、07、08、09四个都是开奖号码之正码，
                视为中奖，如三个正码加上一个特别号码视为不中奖。</dd>
            <dt>2·三中二：</dt>
            <dd>
               所投注的每三个号码为一组合，若其中2个是开奖号码中的正码，即为三中二，视为中奖； 若3个都是开奖号码中的正码，即为三中二之中三，
               其馀情形视为不中奖，如06、07、08 为一组合，开奖号码中有06、07两个正码，没有08，即为三中二，按三中二赔付；
               如开奖 号码中有06、07、08三个正码，即为三中二之中三，按中三赔付；如出现1个或没有，视 为不中奖 。
            </dd>
            <dt>3·三全中：</dt>
            <dd>所投注的每三个号码为一组合，若三个号码都是开奖号码之正码，视为中奖，其馀情形视为 不中奖。如06、07、08三个都是开奖号码之正码，视为中奖，
                如两个正码加上一个特别号 码视为不中奖 。</dd>
            <dt>4·二全中：</dt>
            <dd>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，视为中奖，其馀情形视为不 中奖（含一个正码加一个特别号码之情形）。</dd>
            <dt>5·二中特：</dt>
            <dd>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，叫二中特之中二；若其中一 个是正码，一个是特别号码，叫二中特之中特；其馀情形视为不中奖 。</dd>
            <dt>6·特串：</dt>
            <dd>所投注的每二个号码为一组合，其中一个是正码，一个是特别号码，视为中奖，其馀情形视为 不中奖（含二个号码都是正码之情形） 。</dd>
            
        </dl>
        
        <dl>
           
            <dt>正码过关 ：</dt>
            <dd>
                游戏规则同正码1-6盘势，但须同时投注多项结果，串联成投注组合，只要单期所开出之开奖结果符合您所选定之串联结果，即视为中奖，
                若其中一项结果不中，则视为不中奖；若其中一项结果为和，其余结果都中奖的情形，也视为中奖；和的项目赔率以一计算
            </dd>
            <dt>星座星色 ：</dt>
            <dd>分为星座与星色两种玩法</dd>
        </dl>
        <div class="lottery-title">
            <p>特码星座规则说明</p>
        </div>
        <dl>
            
            <dd>摩羯座 10 , 22 , 34</dd>
            <dd>射手座 09 , 21 , 33</dd>
            <dd>天蝎座 08 , 20 , 32</dd>
            <dd>天枰座 07 , 19 , 31</dd>
            <dd>处女座 06 , 18 , 30</dd>
            <dd>狮子座 05 , 17 , 29</dd>
            <dd>巨蟹座 04 , 16 , 28</dd>
            <dd>双子座 03 , 15 , 27</dd>
            <dd>金牛座 02 , 14 , 26</dd>
            <dd>白羊座 01 , 13 , 25</dd>
            <dd>双鱼座 12 , 24 , 36</dd>
            <dd>水瓶座 11 , 23 , 35</dd>
            <dd>若当期特别号，落在下注星座范围内，视为中奖 。</dd>
        </dl>
        <div class="lottery-title">
            <p>色波规则说明</p>
        </div>
        <dl>
            <dd>以特别号的球色下注，开奖的球色与下注的颜色相同，视为中奖，球色号码分布如下:</dd>
            <dd>
                红波: <span style="color: red">'01', '04', '07', '10', '13', '16', '19', '22', '25', '28', '31', '34',</span>
            </dd>
            <dd>
                蓝波: <span style="color: blue">'02', '05', '08', '11', '14', '17', '20', '23', '26', '29', '32', '35'</span>
            </dd>
            <dd>
                绿波: <span style="color: green">'03', '06', '09', '12', '15', '18', '21', '24','27', '30','33', '36'</span>
            </dd>
        </dl>
        <div class="lottery-title">
            <p>一星座规则说明</p>
        </div>
        <dl>
            <dd> 将星座依序排列，依顺序将36个号码分为12个星座(如下)，再以星座下注。</dd>
            <dd>摩羯座 10 , 22 , 34</dd>
            <dd>射手座 09 , 21 , 33</dd>
            <dd>天蝎座 08 , 20 , 32</dd>
            <dd>天枰座 07 , 19 , 31</dd>
            <dd>处女座 06 , 18 , 30</dd>
            <dd>狮子座 05 , 17 , 29</dd>
            <dd>巨蟹座 04 , 16 , 28</dd>
            <dd>双子座 03 , 15 , 27</dd>
            <dd>金牛座 02 , 14 , 26</dd>
            <dd>白羊座 01 , 13 , 225</dd>
            <dd>双鱼座 12 , 24 , 36</dd>
            <dd>水瓶座 11 , 23 , 35</dd>
            <dd>只要当期号码(所有正码与最后开出的特码)，落在下注星座范围内，则视为中奖。(请注意：36亦算输赢，不为和)。</dd>
        </dl>
        <dl>
            <dt>合星座 ：</dt>
            <dd>
                选1~11星座(排列如同星座)为一组合，并选择开奖号码的特码是否在此组合内，若选择是"中"(可选择2~11个星座)且开奖号码的特码亦在此组合内，即视为中奖；
                若选择否"不中"(可选择1~10个星座),系统会将选择不中的组合改为中的组合；若当期特码开出36号，则所有组合皆视为和局
            </dd>
            <dt>半星色 ：</dt>
            <dd>
               以特码星色和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出36号，则视为和局；其馀情形视为不中奖。
            </dd>
            <dt>半半星色 ：</dt>
            <dd>以特码星色和特码单双及特码大小等三种游戏为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出36号，则视为和局；其馀情形视为不中奖。</dd>
            <dt>正星座 ：</dt>
            <dd>依据开出的所有正码为主。若当期6个正码，只要有1个落在下注星座范围内，视为中奖。如超过1个正码落在下注星座范围内 ，派彩将倍增！</dd>
            <dd>如：下注＄100.-正星座摩羯座赔率1.88</dd>
            <dd>6个正码开出01，派彩为＄88.-</dd>
            <dd>6个正码开出01，13，派彩为＄176.-</dd>
            <dd>6个正码开出01，13，25，派彩为＄264.-</dd>
            <dd>6个正码开出01，13，25，37，派彩为＄352.-</dd>
        </dl>
        <dl>
            <dt>特码头数 ：</dt>
            <dd>指特别号所属头数的号码</dd>
            <dt>"0"头 ：</dt>
            <dd>01，02，03，04，05，06，07，08，09</dd>
            <dt>"1"头 ：</dt>
            <dd>10，11，12，13，14，15，16，17，18，19</dd>
            <dt>"2"头 ：</dt>
            <dd>20，21，22，23，24，25，26，27，28，29</dd>
            <dt>"3"头 ：</dt>
            <dd>30，31，32，33，34，35，36</dd>
            <dd>例如 ：开奖结果特别号码是21则 "2"头为中奖，其他头数都不中奖</dd>
            

            <dt>特码尾数</dt>
            <dd>指特别号所属尾数的号码</dd>
            <dt>"1"尾 ：</dt>
            <dd>01，11，21，31</dd>
            <dt>"2"尾 ：</dt>
            <dd>02，12，22，32</dd>
            <dt>"3"尾 ：</dt>
            <dd>03，13，23，33</dd>
            <dt>"4"尾 ：</dt>
            <dd>04，14，24，34</dd>
            <dt>"5"尾 ：</dt>
            <dd>05，15，25，35</dd>
            <dt>"6"尾 ：</dt>
            <dd>06，16，26，36</dd>
            <dt>"7"尾 ：</dt>
            <dd>07，17，27</dd>
            <dt>"8"尾 ：</dt>
            <dd>08，18，28</dd>
            <dt>"9"尾 ：</dt>
            <dd>09，19，29</dd>
            <dt>"0"尾 ：</dt>
            <dd>10，20，30</dd>
            <dd>例如 ：开奖结果特别号码是21则 "1"尾为中奖，其他尾数都不中奖</dd>
        </dl>
        <dl>
            <dt>平特尾数 ：</dt>
            <dd>只要当期号码(所有正码及开出来的特码)，含所属尾数的一个或多个号码，但派彩只派一次，即不论同尾数号码出现一个或多个号码都只派彩一次。</dd>
            <dt>"1"尾：</dt>
            <dd>01.11.21.31</dd>
            <dt>"2"尾：</dt>
            <dd>02.12.22.32</dd>
            <dt>"3"尾：</dt>
            <dd>03.13.23.33</dd>
            <dt>"4"尾：</dt>
            <dd>04.14.24.34</dd>
            <dt>"5"尾：</dt>
            <dd>05.15.25.35</dd>
            <dt>"6"尾：</dt>
            <dd>06.16.26.36</dd>
            <dt>"7"尾：</dt>
            <dd>07.17.27</dd>
            <dt>"8"尾：</dt>
            <dd>08.18.28</dd>
            <dt>"9"尾：</dt>
            <dd>09.19.29</dd>
            <dt>"0"尾：</dt>
            <dd>10.20.30</dd>
            <dd>例如 ：开奖结果正码是11、21、12、34、35、32特别号码是 21 则"1"尾"2"尾"4"尾"5"尾都为中奖，其他尾数都不中奖。</dd>
        </dl>
        <dl>
            <dt>总星座 ：</dt>
            <dd>当期号码(所有正码与最后开出的特码)开出的不同星座总数，与所投注之预计开出之星座总数和(不用指定特定星座)，则视为中奖，其余情形视为不中奖。
                例如：如果\'当期号码为19、24、12、34、40、39 特别号：36，总计六个星座，若选总肖【6】则为中奖 (请注意：36号亦算输赢，不为和)</dd>
            <dt>总星座单双 ：</dt>
            <dd>当期号码(所有正码与最后开出的特码)开出的不同星座总数若为单数则为单；若为双数则为双。
                例如当期号码为19、24、12、34、20、29.特码：36，则总计六个星座，若下双则中奖。</dd>
            <dt>连星座 ：</dt>
            <dd>挑选2~6星座(排列如同星座)为一个组合，当期号码(所有正码与最后开出的特码)坐落于投注时所勾选之星座组合所属号码内，
                所勾选之星座皆至少有中一个号码，则视为中奖，其余情视为不中奖(请注意36亦算输赢，不为和)
           </dd>
            <dd> 例如：如果当期号码为19、24、12、34、20、29.特码：36，所勾选三个星座，若所有星座的所属号码内至少一个出现于当期号码，则视为中奖。</dd>
            <dt>连尾 ：</dt>
            <dd>挑选2〜6个尾数为一组合，当期号码（所有正码与最后出的特码）坐落于投注时所勾选之尾数组合所属号码内，则视为中奖，其余情形视为不中奖(请注意36亦算输赢，不为和)</dd>
            <dd>举例1：下注2尾碰，勾选0,1，当期七个号码若0尾及1尾皆有开出，视为中奖</dd>
            <dd>举例2：下注2尾碰，勾选0,1,2三种尾数，会出现三种组合（组合一：0,1）（组合二：0,2）（组合三：1,2），当期七个号码若开出其中一种组合所选的两个尾数，视为中奖。</dd>
            <dt>自选不中奖 ：</dt>
            <dd>
                挑选5~12个号码为一个组合，当期号码(所有正码与最后开出的特码)皆没有坐落于投注时所挑选之号码组合内，则视为中奖，
                若是有任何一个当期号码开在所挑选的号码组合情形视为不中奖。
            </dd>
            <dd>
                例如当期号码为19,24,17,34,35,299,特别号36，所挑选5个号码(称为五不中)，若所挑选的号码内皆沒有坐落于当期号码，则为中奖
            </dd>
        </dl>
       
    </div>
</template>

<script>
    import arrayUtil from '../../../assets/js/util/arrayUtil'
    export default {
        
        data () {
            return {
            }
        },
        created(){
            
        },
        methods: {
            
        },
        components: {}
    }
</script>